In [2]:
import numpy as np;

In [3]:
import pandas as pd;

In [ ]:
#In Pandas most of the times we have missing or null values, which gets filled by NaN. Let us see how to drop these
#values from the dataframes

In [ ]:
#Create a dictionary

In [4]:
dict1={'A':[1,2,np.nan],'B':[4,5,np.nan],'C':[6,7,8]}

In [12]:
dict1['A']

[1, 2, nan]

In [ ]:
#Let us create a dataframe from this dict

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

     A    B  C
0  1.0  4.0  6
1  2.0  5.0  7
2  NaN  NaN  8

In [9]:
df.dropna()#drops all rows that have 1 or more nan (by default axis=0)

     A    B  C
0  1.0  4.0  6
1  2.0  5.0  7

In [10]:
df.dropna(axis=1)#drops all columns that have 1 or more nan

   C
0  6
1  7
2  8

In [14]:
df

     A    B  C
0  1.0  4.0  6
1  2.0  5.0  7
2  NaN  NaN  8

In [15]:
df.dropna()

     A    B  C
0  1.0  4.0  6
1  2.0  5.0  7

In [17]:
df.fillna(value='abc')

     A    B  C
0    1    4  6
1    2    5  7
2  abc  abc  8